pr_test_as206610
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.8, local AS number 206610
RIB entries 15, using 1680 bytes of memory
Peers 2, using 9120 bytes of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.5.2      4 30781       9       6        0    0    0 00:01:25        6
171.17.6.3      4 51405      10      12        0    0    0 00:01:21        7

Total number of neighbors 2
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.8
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*  191.168.1.0/24   171.17.6.3                             0 51405 57119 30781 1103 i
*>                  171.17.5.2                             0 30781 1103 i
*  191.168.2.0/24   171.17.6.3                             0 51405 57119 30781 1103 3333 i
*>                  171.17.5.2                             0 30781 1103 3333 i
*  191.168.3.0/24   171.17.6.3                             0 51405 57119 30781 29075 i
*>                  171.17.5.2                             0 30781 29075 i
*  191.168.4.0/24   171.17.6.3                             0 51405 57119 30781 i
*>                  171.17.5.2               0             0 30781 i
*  191.168.5.0/24   171.17.6.3                             0 51405 57119 39351 i
*>                  171.17.5.2                             0 30781 39351 i
*> 191.168.6.0/24   171.17.6.3               0             0 51405 i
*  191.168.7.0/24   171.17.6.3                             0 51405 57119 i
*>                  171.17.5.2                             0 30781 57119 i
*> 191.168.8.0/24   0.0.0.0                  0         32768 i

Total number of prefixes 8
bgpd> pr_test_as57119
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.7, local AS number 57119
RIB entries 15, using 1680 bytes of memory
Peers 3, using 13 KiB of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.7.2      4 51405       4      13        0    0    0 00:01:21        2
171.17.8.3      4 39351      11      13        0    0    0 00:01:21        6
171.17.10.2     4 30781      10       7        0    0    0 00:01:22        7

Total number of neighbors 3
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.7
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*  191.168.1.0/24   171.17.8.3                             0 39351 30781 1103 i
*>                  171.17.10.2                            0 30781 1103 i
*  191.168.2.0/24   171.17.8.3                             0 39351 30781 1103 3333 i
*>                  171.17.10.2                            0 30781 1103 3333 i
*  191.168.3.0/24   171.17.8.3                             0 39351 30781 29075 i
*>                  171.17.10.2                            0 30781 29075 i
*  191.168.4.0/24   171.17.8.3                             0 39351 30781 i
*>                  171.17.10.2              0             0 30781 i
*> 191.168.5.0/24   171.17.8.3               0             0 39351 i
*                   171.17.10.2                            0 30781 39351 i
*  191.168.6.0/24   171.17.10.2                            0 30781 206610 51405 i
*>                  171.17.7.2               0             0 51405 i
*> 191.168.7.0/24   0.0.0.0                  0         32768 i
*  191.168.8.0/24   171.17.7.2                             0 51405 206610 i
*                   171.17.8.3                             0 39351 30781 206610 i
*>                  171.17.10.2                            0 30781 206610 i

Total number of prefixes 8
bgpd> pr_test_as51405
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.6, local AS number 51405
RIB entries 15, using 1680 bytes of memory
Peers 2, using 9120 bytes of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.6.2      4 206610      10      12        0    0    0 00:01:21        7
171.17.7.3      4 57119      11       6        0    0    0 00:01:21        7

Total number of neighbors 2
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.6
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*  191.168.1.0/24   171.17.6.2                             0 206610 30781 1103 i
*>                  171.17.7.3                             0 57119 30781 1103 i
*  191.168.2.0/24   171.17.6.2                             0 206610 30781 1103 3333 i
*>                  171.17.7.3                             0 57119 30781 1103 3333 i
*  191.168.3.0/24   171.17.6.2                             0 206610 30781 29075 i
*>                  171.17.7.3                             0 57119 30781 29075 i
*> 191.168.4.0/24   171.17.7.3                             0 57119 30781 i
*                   171.17.6.2                             0 206610 30781 i
*  191.168.5.0/24   171.17.6.2                             0 206610 30781 39351 i
*>                  171.17.7.3                             0 57119 39351 i
*> 191.168.6.0/24   0.0.0.0                  0         32768 i
*  191.168.7.0/24   171.17.6.2                             0 206610 30781 57119 i
*>                  171.17.7.3               0             0 57119 i
*  191.168.8.0/24   171.17.7.3                             0 57119 30781 206610 i
*>                  171.17.6.2               0             0 206610 i

Total number of prefixes 8
bgpd> pr_test_as39351
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.5, local AS number 39351
RIB entries 15, using 1680 bytes of memory
Peers 2, using 9120 bytes of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.8.2      4 57119      11      13        0    0    0 00:01:21        7
171.17.9.3      4 30781       9      12        0    0    0 00:01:24        7

Total number of neighbors 2
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.5
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 191.168.1.0/24   171.17.9.3                             0 30781 1103 i
*                   171.17.8.2                             0 57119 30781 1103 i
*> 191.168.2.0/24   171.17.9.3                             0 30781 1103 3333 i
*                   171.17.8.2                             0 57119 30781 1103 3333 i
*  191.168.3.0/24   171.17.8.2                             0 57119 30781 29075 i
*>                  171.17.9.3                             0 30781 29075 i
*  191.168.4.0/24   171.17.8.2                             0 57119 30781 i
*>                  171.17.9.3               0             0 30781 i
*> 191.168.5.0/24   0.0.0.0                  0         32768 i
*> 191.168.6.0/24   171.17.8.2                             0 57119 51405 i
*                   171.17.9.3                             0 30781 206610 51405 i
*  191.168.7.0/24   171.17.9.3                             0 30781 57119 i
*>                  171.17.8.2               0             0 57119 i
*  191.168.8.0/24   171.17.8.2                             0 57119 30781 206610 i
*>                  171.17.9.3                             0 30781 206610 i

Total number of prefixes 8
bgpd> pr_test_as30781
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.4, local AS number 30781
RIB entries 15, using 1680 bytes of memory
Peers 5, using 22 KiB of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.3.2      4 29075       6      11        0    0    0 00:01:23        3
171.17.4.3      4  1103       6      10        0    0    0 00:01:25        3
171.17.5.3      4 206610       4      11        0    0    0 00:01:26        2
171.17.9.2      4 39351      10      11        0    0    0 00:01:25        3
171.17.10.3     4 57119       5      12        0    0    0 00:01:23        3

Total number of neighbors 5
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.4
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*  191.168.1.0/24   171.17.3.2                             0 29075 3333 1103 i
*>                  171.17.4.3               0             0 1103 i
*  191.168.2.0/24   171.17.3.2                             0 29075 3333 i
*>                  171.17.4.3                             0 1103 3333 i
*  191.168.3.0/24   171.17.4.3                             0 1103 3333 29075 i
*>                  171.17.3.2               0             0 29075 i
*> 191.168.4.0/24   0.0.0.0                  0         32768 i
*  191.168.5.0/24   171.17.10.3                            0 57119 39351 i
*>                  171.17.9.2               0             0 39351 i
*  191.168.6.0/24   171.17.9.2                             0 39351 57119 51405 i
*                   171.17.10.3                            0 57119 51405 i
*>                  171.17.5.3                             0 206610 51405 i
*  191.168.7.0/24   171.17.9.2                             0 39351 57119 i
*>                  171.17.10.3              0             0 57119 i
*> 191.168.8.0/24   171.17.5.3               0             0 206610 i

Total number of prefixes 8
bgpd> pr_test_as29075
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.3, local AS number 29075
RIB entries 15, using 1680 bytes of memory
Peers 2, using 9120 bytes of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.2.2      4  3333       8      11        0    0    0 00:01:23        6
171.17.3.3      4 30781       9       8        0    0    0 00:01:23        7

Total number of neighbors 2
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.3
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*  191.168.1.0/24   171.17.3.3                             0 30781 1103 i
*>                  171.17.2.2                             0 3333 1103 i
*  191.168.2.0/24   171.17.3.3                             0 30781 1103 3333 i
*>                  171.17.2.2               0             0 3333 i
*> 191.168.3.0/24   0.0.0.0                  0         32768 i
*  191.168.4.0/24   171.17.2.2                             0 3333 1103 30781 i
*>                  171.17.3.3               0             0 30781 i
*> 191.168.5.0/24   171.17.3.3                             0 30781 39351 i
*  191.168.6.0/24   171.17.2.2                             0 3333 1103 30781 206610 51405 i
*>                  171.17.3.3                             0 30781 206610 51405 i
*  191.168.7.0/24   171.17.2.2                             0 3333 1103 30781 57119 i
*>                  171.17.3.3                             0 30781 57119 i
*  191.168.8.0/24   171.17.2.2                             0 3333 1103 30781 206610 i
*>                  171.17.3.3                             0 30781 206610 i

Total number of prefixes 8
bgpd> pr_test_as3333
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.2, local AS number 3333
RIB entries 15, using 1680 bytes of memory
Peers 2, using 9120 bytes of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.1.2      4  1103       9       7        0    0    0 00:01:25        6
171.17.2.3      4 29075       9      10        0    0    0 00:01:23        6

Total number of neighbors 2
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 191.168.1.0/24   171.17.1.2               0             0 1103 i
*> 191.168.2.0/24   0.0.0.0                  0         32768 i
*> 191.168.3.0/24   171.17.2.3               0             0 29075 i
*  191.168.4.0/24   171.17.2.3                             0 29075 30781 i
*>                  171.17.1.2                             0 1103 30781 i
*  191.168.5.0/24   171.17.1.2                             0 1103 30781 39351 i
*>                  171.17.2.3                             0 29075 30781 39351 i
*  191.168.6.0/24   171.17.2.3                             0 29075 30781 206610 51405 i
*>                  171.17.1.2                             0 1103 30781 206610 51405 i
*  191.168.7.0/24   171.17.2.3                             0 29075 30781 57119 i
*>                  171.17.1.2                             0 1103 30781 57119 i
*  191.168.8.0/24   171.17.2.3                             0 29075 30781 206610 i
*>                  171.17.1.2                             0 1103 30781 206610 i

Total number of prefixes 8
bgpd> pr_test_as1103
spawn telnet localhost 2605
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

Hello, this is Quagga (version 0.99.22.4).
Copyright 1996-2005 Kunihiro Ishiguro, et al.


User Access Verification

Password: 
bgpd> show ip bgp summary
BGP router identifier 10.10.10.1, local AS number 1103
RIB entries 15, using 1680 bytes of memory
Peers 2, using 9120 bytes of memory

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
171.17.1.3      4  3333       5      11        0    0    0 00:01:25        3
171.17.4.2      4 30781       8       8        0    0    0 00:01:25        6

Total number of neighbors 2
bgpd> show ip bgp
BGP table version is 0, local router ID is 10.10.10.1
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale, R Removed
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 191.168.1.0/24   0.0.0.0                  0         32768 i
*> 191.168.2.0/24   171.17.1.3               0             0 3333 i
*  191.168.3.0/24   171.17.4.2                             0 30781 29075 i
*>                  171.17.1.3                             0 3333 29075 i
*> 191.168.4.0/24   171.17.4.2               0             0 30781 i
*  191.168.5.0/24   171.17.1.3                             0 3333 29075 30781 39351 i
*>                  171.17.4.2                             0 30781 39351 i
*> 191.168.6.0/24   171.17.4.2                             0 30781 206610 51405 i
*> 191.168.7.0/24   171.17.4.2                             0 30781 57119 i
*> 191.168.8.0/24   171.17.4.2                             0 30781 206610 i

Total number of prefixes 8
bgpd> 